; domain
(define (domain logistic)

(:predicates 
    (location ?l) (truck ?t) (package ?p) 
    (at-location-truck ?a) (at-location-package ?p ?l) 
    (truck-free ?t) (truck-loaded-package ?t ?p)
)

(:action move-truck
    :parameters (?from ?to)
    :precondition (and (location ?from) (location ?to) (at-location-truck ?from))
    :effect (and (at-location-truck ?to) (not (at-location-truck ?from)))
)

(:action load-package
    :parameters (?p ?l ?t)
    :precondition (and (package ?p) (location ?l) (truck ?t) (at-location-truck ?l) (at-location-package ?p ?l) (truck-free ?t))
    :effect (and (truck-loaded-package ?t ?p) (not (at-location-package ?p ?l)) (not (truck-free ?t)))
)

(:action unload-package
    :parameters (?p ?l ?t)
    :precondition (and (package ?p) (location ?l) (truck ?t) (truck-loaded-package ?t ?p) (at-location-truck ?l))
    :effect (and (at-location-package ?p ?l) (truck-free ?t) (not (truck-loaded-package ?t ?p)))
)

)

; problem
(define (problem logistic-delivery-simple) (:domain logistic)
(:objects 
    changi tampines bedok
    package1
    truck
)

(:init
    (location changi) (location tampines) (location bedok)
    (package package1)
    (truck truck)
    (at-location-truck tampines)
    (at-location-package package1 bedok)
    (truck-free truck)
)

(:goal (and (at-location-package package1 changi))
)

)

; plan
1. (move-truck tampines bedok)
   deleted: (at-location-truck tampines)
   added: (at-location-truck bedok)
   goals met: 0 of 1
2. (load-package package1 bedok truck)
   deleted: (at-location-package package1 bedok) (truck-free truck)
   added: (truck-loaded-package truck package1)
   goals met: 0 of 1
3. (move-truck bedok changi)
   deleted: (at-location-truck bedok)
   added: (at-location-truck changi)
   goals met: 0 of 1
4. (unload-package package1 changi truck)
   deleted: (truck-loaded-package truck package1)
   added: (at-location-package package1 changi) (truck-free truck)
   goals met: 1 of 1
